#+STARTUP: show2levels
#+STARTUP: indent
* NLH
** Check if signs of charge treated correctly
** EAD0710
*** Chimax = 2.6
- Overall: 
  - Good convergence
  - H profile not bad
  - L profile wrong--Height increase at high Cs?
**** b10v14 
- H: 10, 25
**** b12v14 
- H: 25 
**** b14v14 
- H: 25
*** Chimax = 3.0
**** b14v14
- End 08/24:
  - Cs 5-100 still running
  - H still much taller than L at all Cs
    - Stiffness scales wrt b^3, but both will be affected
  - L height goes up then down: switching conformations?
  - H end block (5-7) bimodal. Ch dist. wrong?
- 08/24: Rerun L @Cs 1-3 from Cs 5 (1A-3A) and Cs 5 from Cs 3 (4A).
  - First order phase transition?

    
* NFH
** v14 full runs
- Profiles until 4mM look good
- b10v14 continue
  - 08/15: generally good progression
  - 08/22: re-run without SIM
- b12v14
  - @3.0 4, 5          re-init 08/09
    4 (100 -> 50)      re-init 08/16
    re-reun without SIM 08/22
- b14v14 NaN too soon to tell if trend good
  - @2.6 4, 5          re-init 08/09
    4 (300 -> 350)     re-init 08/12
    4 (50 -> 30)       re-init 08/16
    4                  re-init 08/22
    4 (10->0, 30->50)  re-init 08/24
  - @2.8 4, 5, 6       re-init 08/09
    4,5,6 (300 -> 350) re-init 08/12
    4,5,6 (50 -> 30)   re-init 08/16
    4,5                re-init 08/22
    4,5 (30->50, 10->0)re-init 08/24
  - @3.0 4, 5, 6, 8    re-init 08/09
    4,5,6              re-init 08/12
    4,5,6 (50 -> 30)   re-init 08/15
    4,5,6              re-init 08/22
    4,5,6(30->50,10->0)re-init 08/24
    re-run (with SIM, look for crashes) 08/22
    
** v10 runs
*** b10v10
Continue
*** b12v10
Selective to rerun
*** b14v10
Completely rerun
** v12 runs
*** b10v12
Continue
*** b12v12
4, 5 rerun
*** b14v12
Completely rerun


* NAF
** MD learn
- Read references from email (08/09) [1/4]
  - [X] MD.pdf
  - [ ] Polymer MD.pdf
  - [ ] LAMMPS tutorial
  - [ ] LAAMPS examples with scripts
** Confirm with Rui and Clay


* SYSG
** a3
- p2 at low chi (0.95) for p1 crossover
- p3 at low chi (0.95 - 1.10) for any freeE min behavior
*** p1a3 [2/6]
- [X] 0.90 (9)
- [X] 0.95 (18)
- [ ] 1.00 (21)
  - 08/12: From 0.97 (19)
  - 08/15: Unfinished, seems to be p2
  - Pause; maybe coil-p3 at <1.00
- [ ] 1.05 (23)
- [ ] 1.10 (33)
  - From 1.15
  - Turned into p3 -- moved for p3a3/1
  - 08/12: again, andit 10 -> 0
  - 08/15: pause; maybe coil-p3?
- [ ] 1.15 (34)
  - Continue--freeDiff good, inCompmax trend good, AndErr still O(1e-01)
  - 08/10: continue, AndErr O(1e-02)
  - 08/12: continue, AndErr approx 3e-02
  - 08/15: pause; AndErr approx 2.9e-02; maybe coil-p3?
*** p2a3 [1/2]
- [X] 0.95 (14)
  - 08/12: From 0.98 (12)
- [-] 1.07 (19)
  - Init from 1.10 (11): 08/25
*** p3a3 [1/5]
- [-] 1.05 (6)
  - Init from 1.10 (1)
  - Try 1 end: 08/19 -- p2
  - Init from 1.10 (1, 08/19), 50 -> 30
  - Try 2 end: 08/23 -- p2
  - Init from 1.10 (1, 08/23), andIt = 0
  - Try 1 end: 08/25 -- AndErr approx 2.36e-02
    - Pause until p2a3 @1.07 (19): p2 or p3?
- [-] 1.07 (7)
  - Init from 1.10 (1, 08/23)
  - Try 1 end: 08/25 -- AndErr approx 2.18e-02
- [-] 1.10 (1)
  - Try 1 end: 08/12 -- Init from 1.15 (34) p1a3
  - Try 2 end: 08/15 -- AndErr approx 5.7e-02
  - Try 3 end: 08/19 -- AndErr approx 3.9e-02
  - andIt = 0 just to try if faster
  - Try 4 end: 08/25 -- AndErr approx 2.7e-02
  - wcmp 50 -> 60
- [-] 1.15 (2)
  - Init from 1.10, 08/19
  - Try 1 end: 08/23 -- AndErr approx 1.4e-01
- [X] 1.50 (9)
  - Try 2 end: 08/08 -- bad inCompMax trend, wcmp 5 -> 8
  - Try 3 end: 08/10 -- turned into 2C, wcmp 8 -> 6
  - Try 4 end: 08/12 -- inCompMax bad trend, looks like it will turn into 2C
  - End

    
** a4 (DONE)
*** p4a4 [1/1]
- 1.35 (6)
- [X] Not totally converged, but freeE barely changing, graph looks good  
*** a040 calcs
#+NAME: Fa4
|      |  ax1 |       ay1 |  ax2 |       ay2 |     am |  bx1 |       by1 |  bx2 |       by2 |      bm |        px |
|------+------+-----------+------+-----------+--------+------+-----------+------+-----------+---------+-----------|
| p1p4 |  1.1 | 0.0710305 | 1.11 | 0.0973985 | 2.6368 |  1.1 | 0.0713081 | 1.11 | 0.0973226 | 2.60145 | 1.1078529 |
| p4p3 | 1.35 |   0.59808 | 1.40 |  0.677055 | 1.5795 | 1.35 |  0.599839 |  1.4 |   0.67615 | 1.52622 | 1.3830143 |
| p3p2 | 1.55 |   0.86994 | 1.60 |   0.92503 | 1.1018 | 1.55 |  0.872143 |  1.6 |  0.924011 | 1.03736 | 1.5841868 |
| p2p1 | 1.90 |   1.16741 | 1.95 |   1.19934 | 0.6386 |  1.9 |   1.16862 | 1.95 |   1.19705 |  0.5686 | 1.8978720 |
|------+------+-----------+------+-----------+--------+------+-----------+------+-----------+---------+-----------|
#+TBLFM: $7=$2::$9=$4
#+TBLFM: $6=($5-$3)/($4-$2)::$11=($10-$8)/($9-$7)::$12=($6*$2-$11*$7+$8-$3)/($6-$11)

| Ha4  |  ax1 |   ay1 |  ax2 |   ay2 |       ayn |  bx1 |   by1 |  bx2 |   by2 |       byn |        px |
|------+------+-------+------+-------+-----------+------+-------+------+-------+-----------+-----------|
| p1p4 |  1.1 | 80.92 | 1.11 | 80.47 | 80.566620 |  1.1 | 80.92 | 1.11 | 80.47 | 80.566620 | 1.1078529 |
| p4p3 | 1.35 | 61.54 |  1.4 | 54.74 | 57.050055 | 1.35 | 63.01 |  1.4 | 56.67 | 58.823787 | 1.3830143 |
| p3p2 | 1.55 | 40.12 |  1.6 | 38.42 | 38.957649 | 1.55 | 37.97 |  1.6 | 35.23 | 36.096563 | 1.5841868 |
| p2p1 |  1.9 | 29.69 | 1.95 | 29.13 | 29.713834 |  1.9 | 24.48 | 1.95 | 24.03 | 24.499152 |  1.897872 |
|------+------+-------+------+-------+-----------+------+-------+------+-------+-----------+-----------|
#+TBLFM: $1=remote(Fa4,@@#$1)::$2=remote(Fa4,@@#$2)::$4=remote(Fa4,@@#$4)::$7=remote(Fa4,@@#$7)::$9=remote(Fa4,@@#$9)::$12=remote(Fa4,@@#$12)
#+TBLFM: $11=($12-$7)*($10-$8)/($9-$7)+$8::$6=($12-$2)*($5-$3)/($4-$2)+$3



** Eq video [3/4]
- [X] a040
  - [X] Meta calcs
  - [X] Video transitions
- [ ] a030
  - [ ] Meta calcs
  - [ ] Video transitions
- [X] a020
- [X] a000

  
** Reflectivity spectra [3/5]
- [X] Initial coding
- [X] Code in subtrate--different rho_e than polymer?
- [X] Pick regular R_F
  Traced from textbook chapter
- [ ] Find characteristic peaks
- [ ] Needs to be useful for experimentalists
  - How to determine height
  - How to determine conformations
  - Can train ML model given these new conformations?
    
    
* Quals
** Admin [3/3]
- [X] Scheduling
- [X] Application for QE (calcentral/higher ...)
- [X] Schedule practices
** Manuscript [0/2]
- [-] Editing [1/6]
  - [-] Abstract
  - [X] Intro [3/3]
    - [X] Read through
    - [X] References
    - [X] Supp Notes
  - [-] Model and Theory [2/4]
    - [X] Read through
    - [X] References
    - [ ] Supp Notes
    - [ ] Final b/v adapted from Zhulina 2007?
  - [-] Results and Discussion [1/4]
    - [X] Read through
    - [-] Reflectivity section add
    - [ ] References
    - [ ] Supp Notes
  - [-] Conclusions and Future Work [1/3]
    - [X] Read through
    - [ ] References
    - [ ] Supp Notes
  - [-] Figure Update [2/3]
    - [-] Reflectivity
    - [X] Full H prof
    - [X] a040 on
- [-] Supplemental materials [1/4]
  - [X] Variable List
  - [-] SCFT Write up
  - [-] Numerics Flowchart
  - [-] NFH Information [1/2]
    - [X] NFH Sequences
    - [-] Final chis 
** Presentation [6/8]
- [-] Key figures [4/5]
  - [X] a040 only video
  - [X] Sample coarse-graining--update with larger font/symbols
  - [X] Full H prof video
  - [X] Sr2014
  - [-] xC reflectrometry
    - *NEED TO ADD INSIGHT*--how can you tell which xC?
- [-] Supplemental Slides [0/3]
  - [-] SCFT Derivation [1/4]
    - [X] Instant Fourier transform
    - [ ] HS, PB Derive
    - [ ] Propagator integral to PDE
    - [ ] Saddle-point approx
  - [-] Polymer Theory [1/3]
    - [X] Gaussian chain derivation
    - [ ] Worm-like chain model
    - [ ] Gibbs interface
  - [-] Reflectivity [1/3]
    - [X] Apparatus
    - [ ] Procedure
    - [ ] Master Equation derivation (?)
- [X] Button to supp slides into slide master
- [X] Introduction
- [X] New slide feedback
  - [X] "Flowchart" slide:
    Too equation dense?
    Colors/lines/arrows clear?
    Should this be in main pres, or supp only?
    Correct expression for maximum on disc grid?
- [X] SCFT Equation check
- [X] Data pres buildup
  + Height profile, no color
  + Height profile, with color and meta
  + Density profiles
  + FreeE profile
- [X] SCFT Buildup
** Things to go over [3/9]
- [ ] Hubbard Stratonovich (Coulomb operator)
- [ ] Saddle-point approx (ZG Wang chapter)
- [ ] Flory Huggins interaction derivation
- [ ] Functional Derivative and Integration
- [ ] PB equation derivation
- [ ] Difference between reflectivity and diffraction
  - Why is it Fourier transform for both? (Learn about Fourier space)
- [X] Instant operator Fourier transforms
- [X] Propagator derivation
- [X] Gaussian chain derivation

  
* Today: To do list
** TODO Reflectivity reading
*** Relate to thickness of layers; pi/delta q
*** Dilute layer on spectra
*** Plot formatting and update 
*** Characterization of number of peaks
** DONE NFH update
** DONE NLH update
** TODO NFH paper conclusions
*** What insight to put in this paper without overlapping next paper?
** TODO SYSG paper figure list
** TODO SCFT Buildup single particle in field
